---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.NonUniquePropertySetName
source: html/3705822f-1d88-59fe-0173-b146e4fd03a9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.NonUniquePropertySetName Property

The value of the given parameter is already in use as a property set name.

## Syntax (C#)
```csharp
public static FailureDefinitionId NonUniquePropertySetName { get; }
```